; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l3-t1-p16---int100n150-m25---int100c200---s426---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 - fuellevel
)

(:init
(sum level0 level5 level5)
(sum level0 level6 level6)
(sum level0 level16 level16)
(sum level1 level5 level6)
(sum level1 level6 level7)
(sum level1 level16 level17)
(sum level2 level5 level7)
(sum level2 level6 level8)
(sum level2 level16 level18)
(sum level3 level5 level8)
(sum level3 level6 level9)
(sum level3 level16 level19)
(sum level4 level5 level9)
(sum level4 level6 level10)
(sum level4 level16 level20)
(sum level5 level5 level10)
(sum level5 level6 level11)
(sum level5 level16 level21)
(sum level6 level5 level11)
(sum level6 level6 level12)
(sum level6 level16 level22)
(sum level7 level5 level12)
(sum level7 level6 level13)
(sum level7 level16 level23)
(sum level8 level5 level13)
(sum level8 level6 level14)
(sum level8 level16 level24)
(sum level9 level5 level14)
(sum level9 level6 level15)
(sum level9 level16 level25)
(sum level10 level5 level15)
(sum level10 level6 level16)
(sum level10 level16 level26)
(sum level11 level5 level16)
(sum level11 level6 level17)
(sum level11 level16 level27)
(sum level12 level5 level17)
(sum level12 level6 level18)
(sum level12 level16 level28)
(sum level13 level5 level18)
(sum level13 level6 level19)
(sum level13 level16 level29)
(sum level14 level5 level19)
(sum level14 level6 level20)
(sum level14 level16 level30)
(sum level15 level5 level20)
(sum level15 level6 level21)
(sum level15 level16 level31)
(sum level16 level5 level21)
(sum level16 level6 level22)
(sum level16 level16 level32)
(sum level17 level5 level22)
(sum level17 level6 level23)
(sum level17 level16 level33)
(sum level18 level5 level23)
(sum level18 level6 level24)
(sum level18 level16 level34)
(sum level19 level5 level24)
(sum level19 level6 level25)
(sum level19 level16 level35)
(sum level20 level5 level25)
(sum level20 level6 level26)
(sum level20 level16 level36)
(sum level21 level5 level26)
(sum level21 level6 level27)
(sum level21 level16 level37)
(sum level22 level5 level27)
(sum level22 level6 level28)
(sum level22 level16 level38)
(sum level23 level5 level28)
(sum level23 level6 level29)
(sum level23 level16 level39)
(sum level24 level5 level29)
(sum level24 level6 level30)
(sum level24 level16 level40)
(sum level25 level5 level30)
(sum level25 level6 level31)
(sum level25 level16 level41)
(sum level26 level5 level31)
(sum level26 level6 level32)
(sum level26 level16 level42)
(sum level27 level5 level32)
(sum level27 level6 level33)
(sum level27 level16 level43)
(sum level28 level5 level33)
(sum level28 level6 level34)
(sum level28 level16 level44)
(sum level29 level5 level34)
(sum level29 level6 level35)
(sum level30 level5 level35)
(sum level30 level6 level36)
(sum level31 level5 level36)
(sum level31 level6 level37)
(sum level32 level5 level37)
(sum level32 level6 level38)
(sum level33 level5 level38)
(sum level33 level6 level39)
(sum level34 level5 level39)
(sum level34 level6 level40)
(sum level35 level5 level40)
(sum level35 level6 level41)
(sum level36 level5 level41)
(sum level36 level6 level42)
(sum level37 level5 level42)
(sum level37 level6 level43)
(sum level38 level5 level43)
(sum level38 level6 level44)
(sum level39 level5 level44)

(connected l0 l1)
(fuelcost level5 l0 l1)
(connected l0 l2)
(fuelcost level6 l0 l2)
(connected l1 l0)
(fuelcost level5 l1 l0)
(connected l1 l2)
(fuelcost level16 l1 l2)
(connected l2 l0)
(fuelcost level6 l2 l0)
(connected l2 l1)
(fuelcost level16 l2 l1)

(at t0 l1)
(fuel t0 level44)
(= (total-cost) 0)

(at p0 l0)
(at p1 l0)
(at p2 l1)
(at p3 l1)
(at p4 l1)
(at p5 l1)
(at p6 l0)
(at p7 l1)
(at p8 l0)
(at p9 l0)
(at p10 l0)
(at p11 l2)
(at p12 l1)
(at p13 l2)
(at p14 l2)
(at p15 l1)
)

(:goal
(and
(at p0 l2)
(at p1 l2)
(at p2 l2)
(at p3 l0)
(at p4 l2)
(at p5 l2)
(at p6 l2)
(at p7 l0)
(at p8 l1)
(at p9 l1)
(at p10 l2)
(at p11 l1)
(at p12 l0)
(at p13 l1)
(at p14 l1)
(at p15 l2)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p7 t0 l1)
   deleted: (at p7 l1)
   added: (in p7 t0)
   goals met: 0 of 16
2. (load p5 t0 l1)
   deleted: (at p5 l1)
   added: (in p5 t0)
   goals met: 0 of 16
3. (load p4 t0 l1)
   deleted: (at p4 l1)
   added: (in p4 t0)
   goals met: 0 of 16
4. (load p3 t0 l1)
   deleted: (at p3 l1)
   added: (in p3 t0)
   goals met: 0 of 16
5. (load p2 t0 l1)
   deleted: (at p2 l1)
   added: (in p2 t0)
   goals met: 0 of 16
6. (load p15 t0 l1)
   deleted: (at p15 l1)
   added: (in p15 t0)
   goals met: 0 of 16
7. (load p12 t0 l1)
   deleted: (at p12 l1)
   added: (in p12 t0)
   goals met: 0 of 16
8. (drive t0 l1 l0 level39 level5 level44)
   deleted: (at t0 l1) (fuel t0 level44)
   added: (at t0 l0) (fuel t0 level39)
   goals met: 0 of 16
9. (unload p7 t0 l0)
   deleted: (in p7 t0)
   added: (at p7 l0)
   goals met: 1 of 16
10. (unload p3 t0 l0)
   deleted: (in p3 t0)
   added: (at p3 l0)
   goals met: 2 of 16
11. (unload p12 t0 l0)
   deleted: (in p12 t0)
   added: (at p12 l0)
   goals met: 3 of 16
12. (load p9 t0 l0)
   deleted: (at p9 l0)
   added: (in p9 t0)
   goals met: 3 of 16
13. (load p8 t0 l0)
   deleted: (at p8 l0)
   added: (in p8 t0)
   goals met: 3 of 16
14. (load p6 t0 l0)
   deleted: (at p6 l0)
   added: (in p6 t0)
   goals met: 3 of 16
15. (load p10 t0 l0)
   deleted: (at p10 l0)
   added: (in p10 t0)
   goals met: 3 of 16
16. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 3 of 16
17. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 3 of 16
18. (drive t0 l0 l2 level33 level6 level39)
   deleted: (at t0 l0) (fuel t0 level39)
   added: (at t0 l2) (fuel t0 level33)
   goals met: 3 of 16
19. (unload p2 t0 l2)
   deleted: (in p2 t0)
   added: (at p2 l2)
   goals met: 4 of 16
20. (unload p15 t0 l2)
   deleted: (in p15 t0)
   added: (at p15 l2)
   goals met: 5 of 16
21. (unload p10 t0 l2)
   deleted: (in p10 t0)
   added: (at p10 l2)
   goals met: 6 of 16
22. (unload p1 t0 l2)
   deleted: (in p1 t0)
   added: (at p1 l2)
   goals met: 7 of 16
23. (unload p0 t0 l2)
   deleted: (in p0 t0)
   added: (at p0 l2)
   goals met: 8 of 16
24. (load p14 t0 l2)
   deleted: (at p14 l2)
   added: (in p14 t0)
   goals met: 8 of 16
25. (load p13 t0 l2)
   deleted: (at p13 l2)
   added: (in p13 t0)
   goals met: 8 of 16
26. (load p11 t0 l2)
   deleted: (at p11 l2)
   added: (in p11 t0)
   goals met: 8 of 16
27. (unload p4 t0 l2)
   deleted: (in p4 t0)
   added: (at p4 l2)
   goals met: 9 of 16
28. (unload p5 t0 l2)
   deleted: (in p5 t0)
   added: (at p5 l2)
   goals met: 10 of 16
29. (unload p6 t0 l2)
   deleted: (in p6 t0)
   added: (at p6 l2)
   goals met: 11 of 16
30. (drive t0 l2 l1 level17 level16 level33)
   deleted: (at t0 l2) (fuel t0 level33)
   added: (at t0 l1) (fuel t0 level17)
   goals met: 11 of 16
31. (unload p11 t0 l1)
   deleted: (in p11 t0)
   added: (at p11 l1)
   goals met: 12 of 16
32. (unload p13 t0 l1)
   deleted: (in p13 t0)
   added: (at p13 l1)
   goals met: 13 of 16
33. (unload p14 t0 l1)
   deleted: (in p14 t0)
   added: (at p14 l1)
   goals met: 14 of 16
34. (unload p8 t0 l1)
   deleted: (in p8 t0)
   added: (at p8 l1)
   goals met: 15 of 16
35. (unload p9 t0 l1)
   deleted: (in p9 t0)
   added: (at p9 l1)
   goals met: 16 of 16
